app/controllers/paste_controller.rb

  def show
    require 'uv'
    @paste = Paste.find(params[:id].to_i(36))
---
SELECT * FROM `pastes` WHERE (`pastes`.`id` = 123)